In [1]:
import pandas as pd
df = pd.read_csv(r"D:\ml 15 days\logistic regression and binary classification\Titanic-Dataset.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [3]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
df = df.drop(columns=['PassengerId', 'Ticket', 'Cabin','Name'])

In [5]:
df

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0       3    male  22.0      1      0   7.2500        S
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
4           0       3    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0       2    male  27.0      0      0  13.0000        S
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female   NaN      1      2  23.4500        S
889         1       1    male  26.0      0      0  30.0000        C
890         0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [6]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [8]:
 df['Age'] = df['Age'].fillna(df['Age'].mean())

In [9]:
 cvalue =  df['Embarked'].mode()[0]

In [10]:
df['Embarked']=df['Embarked'].fillna( cvalue)

In [11]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [12]:
df = pd.get_dummies(df, columns=['Embarked'], drop_first=True)
df = pd.get_dummies(df, columns=['Sex'], drop_first=True)

In [24]:
from sklearn.preprocessing import MinMaxScaler

# Create a scaler object
scaler = MinMaxScaler()

# Apply scaling to all numeric columns
df_scaled = pd.DataFrame(scaler.fit_transform(df), columns=df.columns)

# Display scaled data
print(df_scaled.head())

   Survived  Pclass       Age  SibSp  Parch      Fare  Embarked_Q  Embarked_S  \
0       0.0     1.0  0.271174  0.125    0.0  0.014151         0.0         1.0
1       1.0     0.0  0.472229  0.125    0.0  0.139136         0.0         0.0
2       1.0     1.0  0.321438  0.000    0.0  0.015469         0.0         1.0
3       1.0     0.0  0.434531  0.125    0.0  0.103644         0.0         1.0
4       0.0     1.0  0.434531  0.000    0.0  0.015713         0.0         1.0

   Sex_male
0       1.0
1       0.0
2       0.0
3       0.0
4       1.0

In [40]:

df_scaled.to_csv('titanic_scaled.csv', index=False)
from IPython.display import FileLink
FileLink('titanic_scaled.csv')

C:\Users\Pranta Dhar\titanic_scaled.csv

In [29]:
df_scaled

,Survived,Pclass,Age,SibSp,Parch,Fare,Embarked_Q,Embarked_S,Sex_male
0,0.0,1.0,0.271174,0.125,0.000000,0.014151,0.0,1.0,1.0
1,1.0,0.0,0.472229,0.125,0.000000,0.139136,0.0,0.0,0.0
2,1.0,1.0,0.321438,0.000,0.000000,0.015469,0.0,1.0,0.0
3,1.0,0.0,0.434531,0.125,0.000000,0.103644,0.0,1.0,0.0
4,0.0,1.0,0.434531,0.000,0.000000,0.015713,0.0,1.0,1.0
...,...,...,...,...,...,...,...,...,...
886,0.0,0.5,0.334004,0.000,0.000000,0.025374,0.0,1.0,1.0
887,1.0,0.0,0.233476,0.000,0.000000,0.058556,0.0,1.0,0.0
888,0.0,1.0,0.367921,0.125,0.333333,0.045771,0.0,1.0,0.0
889,1.0,0.0,0.321438,0.000,0.000000,0.058556,0.0,0.0,1.0
890,0.0,1.0,0.396833,0.000,0.000000,0.015127,1.0,0.0,1.0

In [37]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression

# Define features (X) and target (y)
X = df_scaled.drop('Survived', axis=1)
y = df_scaled['Survived']

# Split the data into train and test sets
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

# Train the logistic regression model
model = LogisticRegression(max_iter=500)  # increase max_iter to avoid convergence warning
model.fit(X_train, y_train)

Mean Squared Error: 0.13500600041144395
R² Score: 0.4432783450214832
Approx Accuracy (after rounding): 0.7932960893854749

In [10]:
 model.score(X_test, y_test)

NameError: name 'model' is not defined

In [35]:
print(model.coef_)

[[-1.78201321 -1.57943592 -1.32499284 -0.47415462  0.50955981 -0.15656079
  -0.48261978 -2.52987218]]

In [46]:
pip install xlrd

Defaulting to user installation because normal site-packages is not writeable
Collecting xlrd
  Downloading xlrd-2.0.2-py2.py3-none-any.whl.metadata (3.5 kB)
Downloading xlrd-2.0.2-py2.py3-none-any.whl (96 kB)
Installing collected packages: xlrd
Successfully installed xlrd-2.0.2
Note: you may need to restart the kernel to use updated packages.

In [9]:
import pandas as pd

df_scaled = pd.read_csv(r'D:\ml 15 days\logistic regression and binary classification\titanic_scaled.xls')
print(df_scaled.head())

   Survived  Pclass       Age  SibSp  Parch      Fare  Embarked_Q  Embarked_S  \
0       0.0     0.0 -0.592240    1.0    0.0 -0.312011         0.0         0.0
1       1.0    -2.0  0.638529    1.0    0.0  2.461242         0.0        -1.0
2       1.0     0.0 -0.284548    0.0    0.0 -0.282777         0.0         0.0
3       1.0    -2.0  0.407760    1.0    0.0  1.673732         0.0         0.0
4       0.0     0.0  0.407760    0.0    0.0 -0.277363         0.0         0.0

   Sex_male
0       0.0
1      -1.0
2      -1.0
3      -1.0
4       0.0

In [11]:
import pandas as pd

# Assuming your scaled DataFrame is called df_scaled
df_scaled.to_csv(r'D:\ml 15 days\logistic regression and binary classification\titanic_scaled.csv', index=False)

In [12]:
df_scaled = pd.read_csv(r'D:\ml 15 days\logistic regression and binary classification\titanic_scaled.csv')
print(df_scaled.head())

   Survived  Pclass       Age  SibSp  Parch      Fare  Embarked_Q  Embarked_S  \
0       0.0     0.0 -0.592240    1.0    0.0 -0.312011         0.0         0.0
1       1.0    -2.0  0.638529    1.0    0.0  2.461242         0.0        -1.0
2       1.0     0.0 -0.284548    0.0    0.0 -0.282777         0.0         0.0
3       1.0    -2.0  0.407760    1.0    0.0  1.673732         0.0         0.0
4       0.0     0.0  0.407760    0.0    0.0 -0.277363         0.0         0.0

   Sex_male
0       0.0
1      -1.0
2      -1.0
3      -1.0
4       0.0

In [13]:
import pandas as pd

# Assuming your scaled DataFrame is called df_scaled
df_scaled.to_csv(r'D:\ml 15 days\logistic regression and binary classification\titanic_scaled.csv', index=False)